# Parameters
nc: 7  # number of classes
depth_multiple: 1  # scales module repeats
width_multiple: 1  # scales convolution channels

backbone:
  - [-1, 1, PatchEmbed, [96, 4]]  # 0 [b, 96, 160, 160]
  - [-1, 1, SwinStage, [96, 2, 3, 7]]  # 1 [b, 96, 160, 160]
  - [-1, 3, C2f, [96]] # 2
  - [-1, 1, PatchMerging, [192]]  # 3 [b, 192, 80, 80]
  - [-1, 1, SwinStage, [192, 2, 6, 7]]  # 4 --F0-- [b, 192, 80, 80]
  - [-1, 6, C2f, [192]]
  - [-1, 1, PatchMerging, [384]]  # 6 [b, 384, 40, 40]
  - [-1, 1, SwinStage, [384, 6, 12, 7]]  # 7 --F1-- [b, 384, 40, 40]
  - [-1, 9, C2f, [384]]
  - [-1, 1, PatchMerging, [768]]  # 9 [b, 768, 20, 20]
  - [-1, 1, SwinStage, [768, 2, 24, 7]]  # 10 --F2-- [b, 768, 20, 20]
  - [-1, 3, C2f, [768]]
  - [-1, 1, CBAM, [768,7]]
  - [-1, 1, SPPF, [768, 5]] #13
   

head:
  - [-1, 1, Conv, [512, 1, 1]] # 14 20  5
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15 40 6
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4 
  - [-1, 3, C2f, [512, False]]  # 17 8

  - [-1, 1, Conv, [256, 1, 1]] # 18 40 9
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 19 80 10
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256, False]]  # 21  12

  - [-1, 1, Conv, [128, 1, 1]] # 22 hp3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # [b, , 160, 160]
  - [[-1, 2], 1, Concat, [1]]  # cat p2
  - [-1, 3, C2f, [128]]  # 25 (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 2]]  # 26 [b, , 80, 80] 
  - [[-1, 22], 1, Concat, [1]]  # cat hp3
  - [-1, 3, C2f, [256]]  # 28 (P3/8-small)


  - [-1, 1, Conv, [256, 3, 2]] # 29 40 13
  - [[-1, 18], 1, Concat, [1]]  # cat head P4 
  - [-1, 3, C2f, [512]]  # 31 (P4/16-medium) 15

  - [-1, 1, Conv, [512, 3, 2]] # 32 20 16
  - [[-1, 14], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 34 (P5/32-large) 18

  - [[25, 28, 31, 34], 1, Detect, [nc]]  # Detect(P3, P4, P5)
  